load/results/20260504-220411-smoke/k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/paymei/Documents/Development/github/meyouquize/load/k6-http.js
        output: -

     scenarios: (100.00%) 1 scenario, 15 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 15 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 15/15 VUs, 366 complete and 0 interrupted iterations
default   [   2% ] 15 VUs  0m01.0s/1m0s

running (0m02.0s), 15/15 VUs, 856 complete and 0 interrupted iterations
default   [   3% ] 15 VUs  0m02.0s/1m0s

running (0m03.0s), 15/15 VUs, 1369 complete and 0 interrupted iterations
default   [   5% ] 15 VUs  0m03.0s/1m0s

running (0m04.0s), 15/15 VUs, 1843 complete and 0 interrupted iterations
default   [   7% ] 15 VUs  0m04.0s/1m0s

running (0m05.0s), 15/15 VUs, 2358 complete and 0 interrupted iterations
default   [   8% ] 15 VUs  0m05.0s/1m0s

running (0m06.0s), 15/15 VUs, 2831 complete and 0 interrupted iterations
default   [  10% ] 15 VUs  0m06.0s/1m0s

running (0m07.0s), 15/15 VUs, 3355 complete and 0 interrupted iterations
default   [  12% ] 15 VUs  0m07.0s/1m0s

running (0m08.0s), 15/15 VUs, 3890 complete and 0 interrupted iterations
default   [  13% ] 15 VUs  0m08.0s/1m0s

running (0m09.0s), 15/15 VUs, 4379 complete and 0 interrupted iterations
default   [  15% ] 15 VUs  0m09.0s/1m0s

running (0m10.0s), 15/15 VUs, 4892 complete and 0 interrupted iterations
default   [  17% ] 15 VUs  0m10.0s/1m0s

running (0m11.0s), 15/15 VUs, 5410 complete and 0 interrupted iterations
default   [  18% ] 15 VUs  0m11.0s/1m0s

running (0m12.0s), 15/15 VUs, 5893 complete and 0 interrupted iterations
default   [  20% ] 15 VUs  0m12.0s/1m0s

running (0m13.0s), 15/15 VUs, 6450 complete and 0 interrupted iterations
default   [  22% ] 15 VUs  0m13.0s/1m0s

running (0m14.0s), 15/15 VUs, 6982 complete and 0 interrupted iterations
default   [  23% ] 15 VUs  0m14.0s/1m0s

running (0m15.0s), 15/15 VUs, 7551 complete and 0 interrupted iterations
default   [  25% ] 15 VUs  0m15.0s/1m0s

running (0m16.0s), 15/15 VUs, 8058 complete and 0 interrupted iterations
default   [  27% ] 15 VUs  0m16.0s/1m0s

running (0m17.0s), 15/15 VUs, 8586 complete and 0 interrupted iterations
default   [  28% ] 15 VUs  0m17.0s/1m0s

running (0m18.0s), 15/15 VUs, 9193 complete and 0 interrupted iterations
default   [  30% ] 15 VUs  0m18.0s/1m0s

running (0m19.0s), 15/15 VUs, 9715 complete and 0 interrupted iterations
default   [  32% ] 15 VUs  0m19.0s/1m0s

running (0m20.0s), 15/15 VUs, 10200 complete and 0 interrupted iterations
default   [  33% ] 15 VUs  0m20.0s/1m0s

running (0m21.0s), 15/15 VUs, 10730 complete and 0 interrupted iterations
default   [  35% ] 15 VUs  0m21.0s/1m0s

running (0m22.0s), 15/15 VUs, 11257 complete and 0 interrupted iterations
default   [  37% ] 15 VUs  0m22.0s/1m0s

running (0m23.0s), 15/15 VUs, 11804 complete and 0 interrupted iterations
default   [  38% ] 15 VUs  0m23.0s/1m0s

running (0m24.0s), 15/15 VUs, 12313 complete and 0 interrupted iterations
default   [  40% ] 15 VUs  0m24.0s/1m0s

running (0m25.0s), 15/15 VUs, 12801 complete and 0 interrupted iterations
default   [  42% ] 15 VUs  0m25.0s/1m0s

running (0m26.0s), 15/15 VUs, 13307 complete and 0 interrupted iterations
default   [  43% ] 15 VUs  0m26.0s/1m0s

running (0m27.0s), 15/15 VUs, 13792 complete and 0 interrupted iterations
default   [  45% ] 15 VUs  0m27.0s/1m0s

running (0m28.0s), 15/15 VUs, 14281 complete and 0 interrupted iterations
default   [  47% ] 15 VUs  0m28.0s/1m0s

running (0m29.0s), 15/15 VUs, 14806 complete and 0 interrupted iterations
default   [  48% ] 15 VUs  0m29.0s/1m0s

running (0m30.0s), 15/15 VUs, 15274 complete and 0 interrupted iterations
default   [  50% ] 15 VUs  0m30.0s/1m0s

running (0m31.0s), 15/15 VUs, 15799 complete and 0 interrupted iterations
default   [  52% ] 15 VUs  0m31.0s/1m0s

running (0m32.0s), 15/15 VUs, 16351 complete and 0 interrupted iterations
default   [  53% ] 15 VUs  0m32.0s/1m0s

running (0m33.0s), 15/15 VUs, 16875 complete and 0 interrupted iterations
default   [  55% ] 15 VUs  0m33.0s/1m0s

running (0m34.0s), 15/15 VUs, 17402 complete and 0 interrupted iterations
default   [  57% ] 15 VUs  0m34.0s/1m0s

running (0m35.0s), 15/15 VUs, 17885 complete and 0 interrupted iterations
default   [  58% ] 15 VUs  0m35.0s/1m0s

running (0m36.0s), 15/15 VUs, 18372 complete and 0 interrupted iterations
default   [  60% ] 15 VUs  0m36.0s/1m0s

running (0m37.0s), 15/15 VUs, 18873 complete and 0 interrupted iterations
default   [  62% ] 15 VUs  0m37.0s/1m0s

running (0m38.0s), 15/15 VUs, 19357 complete and 0 interrupted iterations
default   [  63% ] 15 VUs  0m38.0s/1m0s

running (0m39.0s), 15/15 VUs, 19863 complete and 0 interrupted iterations
default   [  65% ] 15 VUs  0m39.0s/1m0s

running (0m40.0s), 15/15 VUs, 20332 complete and 0 interrupted iterations
default   [  67% ] 15 VUs  0m40.0s/1m0s

running (0m41.0s), 15/15 VUs, 20821 complete and 0 interrupted iterations
default   [  68% ] 15 VUs  0m41.0s/1m0s

running (0m42.0s), 15/15 VUs, 21273 complete and 0 interrupted iterations
default   [  70% ] 15 VUs  0m42.0s/1m0s

running (0m43.0s), 15/15 VUs, 21791 complete and 0 interrupted iterations
default   [  72% ] 15 VUs  0m43.0s/1m0s

running (0m44.0s), 15/15 VUs, 22312 complete and 0 interrupted iterations
default   [  73% ] 15 VUs  0m44.0s/1m0s

running (0m45.0s), 15/15 VUs, 22793 complete and 0 interrupted iterations
default   [  75% ] 15 VUs  0m45.0s/1m0s

running (0m46.0s), 15/15 VUs, 23324 complete and 0 interrupted iterations
default   [  77% ] 15 VUs  0m46.0s/1m0s

running (0m47.0s), 15/15 VUs, 23853 complete and 0 interrupted iterations
default   [  78% ] 15 VUs  0m47.0s/1m0s

running (0m48.0s), 15/15 VUs, 24346 complete and 0 interrupted iterations
default   [  80% ] 15 VUs  0m48.0s/1m0s

running (0m49.0s), 15/15 VUs, 24838 complete and 0 interrupted iterations
default   [  82% ] 15 VUs  0m49.0s/1m0s

running (0m50.0s), 15/15 VUs, 25437 complete and 0 interrupted iterations
default   [  83% ] 15 VUs  0m50.0s/1m0s

running (0m51.0s), 15/15 VUs, 25910 complete and 0 interrupted iterations
default   [  85% ] 15 VUs  0m51.0s/1m0s

running (0m52.0s), 15/15 VUs, 26404 complete and 0 interrupted iterations
default   [  87% ] 15 VUs  0m52.0s/1m0s

running (0m53.0s), 15/15 VUs, 26898 complete and 0 interrupted iterations
default   [  88% ] 15 VUs  0m53.0s/1m0s

running (0m54.0s), 15/15 VUs, 27446 complete and 0 interrupted iterations
default   [  90% ] 15 VUs  0m54.0s/1m0s

running (0m55.0s), 15/15 VUs, 27899 complete and 0 interrupted iterations
default   [  92% ] 15 VUs  0m55.0s/1m0s

running (0m56.0s), 15/15 VUs, 28369 complete and 0 interrupted iterations
default   [  93% ] 15 VUs  0m56.0s/1m0s

running (0m57.0s), 15/15 VUs, 28905 complete and 0 interrupted iterations
default   [  95% ] 15 VUs  0m57.0s/1m0s

running (0m58.0s), 15/15 VUs, 29429 complete and 0 interrupted iterations
default   [  97% ] 15 VUs  0m58.0s/1m0s

running (0m59.0s), 15/15 VUs, 29918 complete and 0 interrupted iterations
default   [  98% ] 15 VUs  0m59.0s/1m0s

running (1m00.0s), 15/15 VUs, 30399 complete and 0 interrupted iterations
default   [ 100% ] 15 VUs  1m00.0s/1m0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration
    ✓ 'p(95)<500' p(95)=18.23ms
    ✓ 'p(99)<900' p(99)=230.09ms

    http_req_failed
    ✓ 'rate<0.02' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 60838   1010.103123/s
    checks_succeeded...: 100.00% 60838 out of 60838
    checks_failed......: 0.00%   0 out of 60838

    ✓ healthz:200
    ✓ readyz:200

    HTTP
    http_req_duration..............: avg=14.7ms  min=5.39ms  med=10.51ms max=453.05ms p(90)=14.66ms p(95)=18.23ms
      { expected_response:true }...: avg=14.7ms  min=5.39ms  med=10.51ms max=453.05ms p(90)=14.66ms p(95)=18.23ms
    http_req_failed................: 0.00%  0 out of 60838
    http_reqs......................: 60838  1010.103123/s

    EXECUTION
    iteration_duration.............: avg=29.59ms min=12.08ms med=21.52ms max=472.42ms p(90)=29.57ms p(95)=37.61ms
    iterations.....................: 30419  505.051562/s
    vus............................: 15     min=15         max=15
    vus_max........................: 15     min=15         max=15

    NETWORK
    data_received..................: 28 MB  472 kB/s
    data_sent......................: 2.4 MB 40 kB/s



running (1m00.2s), 00/15 VUs, 30419 complete and 0 interrupted iterations
default ✓ [ 100% ] 15 VUs  1m0s